snlkuharlocal/src/InformationRegisters/ИнформацияШКЛН/ИнформацияШКЛН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИнформацияШКЛН</name>
  <attributes>
    <name>НомерЛН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКоробок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКоробки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКоробкиЛН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Накладная</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <dimensions>
    <name>ШК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ШКЛистаНабора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/ИнформацияШКЛН/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	//крохин начало 25.12.2013
	//проверка на корректность, при ошибке пишем в лог
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ИнформацияШКЛН.ШК,
		|	ИнформацияШКЛН.ШКЛистаНабора,
		|	ИнформацияШКЛН.НомерЛН
		|ИЗ
		|	РегистрСведений.ИнформацияШКЛН КАК ИнформацияШКЛН
		|ГДЕ
		|	ИнформацияШКЛН.ШК = &ШК
		|	И ИнформацияШКЛН.ШКЛистаНабора <> &ШКЛистаНабора
		//кухарь 29.04.15 начало
		|	И ИнформацияШКЛН.Год = &Год";
		//кухарь 29.04.15 конец 
		Запрос.УстановитьПараметр("ШК",Запись.ШК);
		Запрос.УстановитьПараметр("ШКЛистаНабора",Запись.ШКЛистаНабора);
		//кухарь 29.04.15 начало
		запрос.УстановитьПараметр("Год",НачалоГода(ТекущаяДата()));
		//кухарь 29.04.15 конец 
		
		выборка = запрос.Выполнить().Выбрать();
		Если выборка.Следующий() Тогда
			ЗаписатьВЛог("дубль ШК ЛН","ШК: "+выборка.ШК + " .ЛН существующий: "+выборка.НомерЛН+" . ШКЛН: "+выборка.ШКЛистаНабора+" ЛН новый: "+Запись.НомерЛН+" ШК ЛН: "+запись.ШКЛистаНабора  ,"Информация") ;
			//кухарь 15.04.15 начало
			отказ=Истина;
			//кухарь 15.04.15 конец
		КонецЕсли;
		
		//Кухарь 24.03.16 начало
		//почему то иногда номер накладной сбивается
		Запись.НомерНакладной=Лев(запись.НомерЛН,10);
		//Кухарь 24.03.16 конец

	КонецЦикла;
	//крохин конец 25.12.2013
	
	//Кухарь 12.01.16 начало
	//Не грузим больше
	//Если ОбменДанными.Загрузка И ПараметрыСеанса.ЭтотУзел.ТипУзла <> Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
	//	НадоВыгружать = Ложь;
	//Иначе
	//	НадоВыгружать = Истина;
	//КонецЕсли;
	//Если НадоВыгружать Тогда
	//	УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
	//КонецЕсли;
	//Кухарь 12.01.16 конец
КонецПроцедуры
